src/test/java/features/WorkOrders/WO_Payloads/updateWO_addSurfaceTask_payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:max="http://www.ibm.com/maximo">
   <soapenv:Header />
   <soapenv:Body>
      <max:UpdateYVWWORKORDER creationDateTime="2008-09-29T11:49:45">
         <max:YVWWORKORDERSet>
            <max:WORKORDER action="Change">
               <max:SITEID>YVW</max:SITEID>
               <max:WONUM>#(woNum)</max:WONUM>
               <max:WOACTIVITY>
                  <max:CLASSSTRUCTUREID>#(classStructureID)</max:CLASSSTRUCTUREID>
                  <max:STATUS>TASKFUREQ</max:STATUS>
                  <max:DESCRIPTION>#(WOActivityDescription)</max:DESCRIPTION>
               </max:WOACTIVITY>
            </max:WORKORDER>
         </max:YVWWORKORDERSet>
      </max:UpdateYVWWORKORDER>
   </soapenv:Body>
</soapenv:Envelope>